Revit 2026 API

# ApplicationDefaultViewDiscipline Property

---

The view discipline that will be applied to new views by default.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ViewDiscipline DefaultViewDiscipline { get; set; }
```
```vb
Public Property DefaultViewDiscipline As ViewDiscipline
	Get
	Set
```
```cpp
public:
property ViewDiscipline DefaultViewDiscipline {
	ViewDiscipline get ();
	void set (ViewDiscipline value);
}
```
```fsharp
member DefaultViewDiscipline : ViewDiscipline with get, set
```

#### Property Value

ViewDiscipline

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | When setting this property: This functionality is not available in Revit LT. |

This view discipline may be overridden by a view template when a view template is also applied to new views.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace